/*
Составить программу на Си,
которая печатает таблицу значений элементарной функции,
вычисленной двумя способами: по формуле Тейлора и с помощью встроенных функций языка программирования.
*/
#include <math.h>
#include <stdio.h>
double g(double x) // встроенная функция
{
	return (2. * x - 3)/(pow(x - 1., 2));
}
int main()
{
	double x, d, S, eps = 1., k=1, a = 0.1, b = 0.6;
	long double h;
	int n;
	int m, i;
	printf("Введите число итераций\n");
	scanf("%Lf", &h);
	h = (b - a) / h;
	while (1. + eps > 1.) {
		eps /= 2.;
	} // вычисляем эпсилон машины
	printf("Machine epsilon = %.21f\n", eps);
	printf("---------------------------------------------------------------\n");
	printf("|   x    |             S         |     (2x-3)/(x-1)^2    |  n |\n");
	printf("|--------|-----------------------|-----------------------|----|\n");

	for (x = a; x < b + 0.001; x += h)
	{
		d = 1;
		S = 0; n = 1;
		while (fabs(d) > k*eps)
		{
			i = 1; d = -3;
			while (i < n) { d = d * (i+3) * (x) / (i+2); i++; }
			
			S += d; n++;
		}
		if (fabs(S) >= 10) {
			printf("| %.4f | %.17f | %.17f | %2d |\n", x, S, g(x), n);
		}
		else if (n < 101) {
			printf("| %.4f | %.18f | %.18f | %2d |\n", x, S, g(x), n);
		}
	}
	printf("---------------------------------------------------------------\n");
	return 0;
}
