/*
Необходимо определить попадание движущейся по двухмерной целочисленной сетке точки в специальную геометрическую область не более чем за 50 шагов.
Передвижение точки определяется специальными формулами и зависит от её текущего положения (i, j), динамического параметра движения l и дискретного времени k.
Положение точки на сетке (i0, j0) и значение динамического параметра l0 в нулевой момент времени (k = 0) подаются со стандартного потока ввода.
Результатом работы программы является информация о попадании точки в заданную геометрическую область.
Вычисления останавливаются при попадании точки в заданную область или при превышении допустимого количества шагов.
Геометрическая область: квадрат с длиной стороны 10, стороны квадрата параллельны осям координат, центр квадрата в точке (10, −10).
*/
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <stdio.h>
int main(void)
{
    int i, j, l, a, pl, mn, max, min, k, k0, div, div1;
    scanf("%d", &i);
    scanf("%d", &j);
    scanf("%d", &l);
    a = 0; k0 = 0; mn = 0; pl = 0;
    if ((i >= 5) && (i <= 15) && (j >= -15) && (j <= -5)) {
        printf("Yes\n");
        printf("%d ", i);
        printf("%d ", j);
        printf("%d ", l);
        printf("%d\n", 0);
        return 0;
    }
    for (k = 1; k <= 50; ++k) {
        int i1 = i;
        int j1 = j;
        int l1 = l;
        k0 = k - 1;
        if (i1 > 0) {
            pl = 1;
        }
        if (i1 == 0) {
            pl = 0;
        }
        if (i1 < 0) {
            pl = -1;
        }
        if (j1 > 0) {
            mn = 1;
        }
        if (j1 == 0) {
            mn = 0;
        }
        if (j1 < 0) {
            mn = -1;
        }
        if (((i1 + k0) * (j1 - k0) * (l1 + k0)) >= 0) {
            div = (i1 + k0) * (j1 - k0) * (l1 + k0) / 25;
        }
        if (((i1 + k0) * (j1 - k0) * (l1 + k0) < 0) && ((i1 + k0) * (j1 - k0) * (l1 + k0) % 25 != 0)) {
            div = ((i1 + k0) * (j1 - k0) * (l1 + k0) / 25) - 1;
        }
        if (((i1 + k0) * (j1 - k0) * (l1 + k0)) % 25 == 0) {
            div = (((i1 + k0) * (j1 - k0) * (l1 + k0)) / 25);
        }
        i = (i1 + k0) * (j1 - k0) * (l1 + k0) - (div * 25);
        if ((j1 - k0) > (l1 - k0)) {
            max = j1 - k0;
        } else {
            max = l1 - k0;
        }
        if ((i1 + k0) < max) {
            min = i1 + k0;
        } else {
            min = max;
        }
        if (min >= 0) {
            div1 = min / 30;
        }
        if ((min < 0) && (min % 30 != 0)) {
            div1 = min / 30 - 1;
        }
        if (min % 30 == 0) {
            div1 = min / 30;
        }
        j = min - div1 * 30;
        l = abs(j1 - l1) * pl - abs(i1 - l1) * mn;
        if ((i >= 5) && (i <= 15) && (j >= -15) && (j <= -5)) {
            printf("Yes\n");
            printf("%d ", i);
            printf("%d ", j);
            printf("%d ", l);
            printf("%d\n", k);
            a = 1;
            break;
        }
    }
    if ((a == 0)) {
        printf("No\n");
        printf("%d ", i);
        printf("%d ", j);
        printf("%d ", l);
        printf("%d\n", 50);
    }
    return 0;
}
            
